# TrussMissingReference Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..TrussMissingReference Property
BuiltInFailures..::..SketchFailures Class See Also
---
Trusses require both a top and a bottom chord reference (chain of one or more reference lines).
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId TrussMissingReference { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TrussMissingReference As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ TrussMissingReference {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace